#include "../include/utils.h"
#include "../include/custom/fgetch.h"
#include "../include/custom/print.h"
#include "../include/Menu.h"
#include <iostream>
using namespace std;

void Menu::showMainMenu()
{
    cout << "\n╔═════════════════════════════════════════════════════════╗\n"
            "║                                                         ║\n"
            "║                       ГЛАВНОЕ МЕНЮ                      ║\n"
            "║                                                         ║\n"
            "║   1. Установить строку                                  ║\n"
            "║   2. Показать строку                                    ║\n"
            "║   3. Посчитать разность длин с другой строкой           ║\n"
            "║   4. Длина строки                                       ║\n"
            "║   5. Проверить пустая ли строка                         ║\n"
            "║   6. Количество объектов                                ║\n"
            "║   7. Удалить строку                                     ║\n"
            "║   0. Выход                                              ║\n"
            "║                                                         ║\n"
            "╚═════════════════════════════════════════════════════════╝\n";
}

void Menu::run()
{
    StringArray arr1;
    StringArray arr2;
    char choice;

    const int buffer = 256;
    char* input = new char[buffer];

    do
    {
        clearScreen();
        showMainMenu();
        cout << "\n╭────────────────────────────────────────╮\n"
                "│          Введите пункт меню:           │\n"
                "╰────────────────────────────────────────╯\n"
                "╰─> ";
        fflush(stdout);
        choice = fgetch();
        cout << choice << endl;
        py::print();

        switch (choice)
        {
            case '1':
                cout << "\n╭────────────────────────────────────────╮\n"
                        "│          Введите строку:               │\n"
                        "╰────────────────────────────────────────╯\n"
                        "╰─> ";
                cin.getline(input, buffer);
                arr1.setString(input);
                cout << "\n╭──────────────────────────────╮\n"
                        "│       Строка установлена     │\n"
                        "╰──────────────────────────────╯\n";
                break;

            case '2':
                cout << "\n╭──────────────────────────────╮\n"
                        "│        Текущая строка:       │\n"
                        "╰──────────────────────────────╯\n";
                arr1.printString();
                break;

            case '3':
                cout << "\n╭────────────────────────────────────────╮\n"
                        "│   Введите строку для вычитания:        │\n"
                        "╰────────────────────────────────────────╯\n"
                        "╰─> ";
                cin.getline(input, buffer);
                arr2.setString(input);
                cout << "\n╭──────────────────────────────╮\n"
                        "     Разность длин: " << (arr1 - arr2) << " \n"
                        "╰──────────────────────────────╯\n";
                break;

            case '4':
                cout << "\n╭──────────────────────────────╮\n"
                        "     Длина строки: " << arr1.getLength() << " \n"
                           "╰──────────────────────────────╯\n";
                break;

            case '5':
                cout << "\n╭──────────────────────────────╮\n"
                        "      " << (arr1.isEmpty() ? "Строка пустая" : "Строка не пустая") << " \n"
                           "╰──────────────────────────────╯\n";
                break;

            case '6':
                cout << "\n╭──────────────────────────────╮\n"
                        " Количество объектов: " << StringArray::getObjectCount() << " \n"
                        "╰──────────────────────────────╯\n";
                break;

            case '7':
                arr1.clearString();
                cout << "\n╭──────────────────────────────╮\n"
                        "│        Строка удалена        │\n"
                        "╰──────────────────────────────╯\n";
                break;


            case '0':
                cout << "\n╭──────────────────────────────╮\n"
                        "│            Выход             │\n"
                        "╰──────────────────────────────╯\n";
                std::cout << "\n    Выход";
                loadingAnimation(3, 300);
                break;

            default:
                cout << "\n╭──────────────────────────────╮\n"
                        "│        Неверный ввод!        │\n"
                        "╰──────────────────────────────╯\n";
                break;
        }

        if (choice != '0')
        {
            py::print();
            py::print();
            cout << "\nНажмите Enter для продолжения...";
            cin.get();
        }

    } while (choice != '0');

    delete[] input;
}